#  Напишите программу, удаляющую из текста все слова, содержащие ""абв"".

text_str ='шел по лесу абв Дед Мороз мимо кленов АБВ и берез абв'
new_str = text_str.replace('абв','')
print(new_str)




